## лаб8 Євчика Олексія

# -----------------------
# 1. Створення сітки
# -----------------------
x <- seq(-pi, pi, length = 100)
y <- seq(-pi, pi, length = 100)

# Створення матриці всіх комбінацій (сітка координат)
grid <- expand.grid(x = x, y = y)

# Обчислюємо значення функції
z <- matrix(sin(grid$x) * cos(grid$y), 
            nrow = length(x), 
            ncol = length(y))

# -----------------------
# 2. Побудова 3D поверхні
# -----------------------
persp(x, y, z,
      theta = 45, phi = 30,        # Поворот камери
      col = "tomato",           # Колір поверхні
      border = "grey20",           # Колір ліній
      shade = 0.3,                 # Ефект освітлення
      xlab = "X", ylab = "Y", zlab = "Z",
      main = "3D поверхня: z = sin(x) * cos(y)")

